# MEPAnalytical Segment Get Flow Convergence Characteristic Method

Source: https://www.revitapidocs.com/2026/b340bcd8-2fe2-b3c0-a1ca-0182375b22c1.htm

---

| MEPAnalytical Segment Get Flow Convergence Characteristic Method |
| --- |

Gets the flow convergence characteristic of the segment.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public FlowConvergenceCharacteristic GetFlowConvergenceCharacteristic(
	Document doc,
	out FlowPositionCharacteristic outPosition
)
```

```
Public Function GetFlowConvergenceCharacteristic (
	doc As Document,
	<OutAttribute> ByRef outPosition As FlowPositionCharacteristic
) As FlowConvergenceCharacteristic
```

```
public:
FlowConvergenceCharacteristic GetFlowConvergenceCharacteristic(
	Document^ doc,
	[OutAttribute] FlowPositionCharacteristic% outPosition
)
```

```
member GetFlowConvergenceCharacteristic :
        doc : Document *
        outPosition : FlowPositionCharacteristic byref -> FlowConvergenceCharacteristic
```

#### Parameters

doc Document
:   The document of this segment.

outPosition FlowPositionCharacteristic
:   The acquired flow position characteristic of the segment, undefined if the convergence characteristic is undefined.

#### Return Value

FlowConvergenceCharacteristic Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

MEPAnalyticalSegment Class Autodesk.Revit.DB.Analysis Namespace